Repository: leonardcj/jigsaw-puzzle-branch
Catalog: po/ach.po
Languages: ach

source: Jigsaw Puzzle
ach: Ka gwenyo wic me Jigsaw

source: Buddy '%(buddy)s' changed status: %(status)s
ach: Dyera '%(buddy)s' alokaloka ikwo mere: %(status)s

source: Buddy '%s' joined the game!
ach: Dyera '%s' odonyo ituku!

source: Buddy '%s' left the game!
ach: Dyers '%s' oweko tuku!

source: Solve
ach: Tyeki

source: Shuffle
ach: Lok yie

source: My Picture
ach: Cala

source: Board Hint
ach: Kony ame Bod mio

source: Time:
ach: Cawa:

source: Lesson Plans
ach: Lecon Plan

source: Select image and press Start Game...
ach: Yer cal eka ite diyo Cak Tuku...

source: Waiting for Puzzle image to be chosen...
ach: The ka kuru yero Cal me gigwenyo wic...

source: Buddies
ach: Dyere na

source: Game Running
ach: Tuku tye ame awot anyim

source: Start Game
ach: Cak Tuku

source: Choose a Subject
ach: Yer Lok

source: Puzzle Solved!
ach: Otyeko nwongo yore me Lagweny wic!

source: Press Stop on the Toolbar to Exit Activity!
ach: Di Giki ikom Tulba wek iya oko Igin itimo!

source: Jigsaw Puzzle Activity
ach: Gin atima me Lagweny wic me Jigsaw

source: Close Lesson
ach: Cegi lecon

source: Game Started!
ach: Tuku ocake!

source: Waiting for Puzzle image to be transferred...
ach: Ikuru kobo cal me gigwenyo wic...

source: Overview
ach: Imalomalo

source: Lesson 3
ach: Lecon 3

source: Lesson 1
ach: Lecon 1

source: Lesson 2
ach: Lecon 2

source: Buddy
ach: Dyera

source: Status
ach: Kit atye kede

source: Play Time
ach: Cawa me Tuku

source: Joined at
ach: Odonyo iye ikom cawa

source: synchronizing
ach: Nonoto

source: Playing
ach: Tye ka tuku

source: Paused
ach: Ocung oko

source: Finished
ach: Otumu

source: Gave up
ach: Oweku

source: Unknown
ach: Pe ongeo

source: %i minutes
ach: %i dakike

source: Chinese (simplified)
ach: Chinese (anyangere)

source: Chinese (traditional)
ach: Chinese (acon me tekwaro)

source: English
ach: Leb Muno

source: English - Great Britain
ach: Leb Munu - Great Britain

source: English - U.S.
ach: Leb Munu - U.S.

source: Finnish
ach: Finnic

source: Japanese
ach: Japanis

source: Norwegian
ach: Norweigan

source: Swedish
ach: Swedic

source: Choose image
ach: Yer cal

source: Not a valid image file
ach: Pail me cal pe tye kakare
